{
  "base_model_name_or_path": "Qwen/Qwen2.5-1.5B-Instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": ["gate_proj", "k_proj", "o_proj", "down_proj", "v_proj", "up_proj", "q_proj"],
  "task_type": "CAUSAL_LM"
}
